In [1]:
import pandas as pd
import numpy as np

# 시리즈 만들기

In [3]:
dict_data={'a':1, 'b':2,'c':3}
print(dict_data)

{'a': 1, 'b': 2, 'c': 3}

In [4]:
k= pd.Series(dict_data)
print(type(k))
print(k)

<class 'pandas.core.series.Series'>
a    1
b    2
c    3
dtype: int64

In [5]:
k['a'] #인덱스 조회

1

In [5]:
list_data=['2021-0506','부천대','전자과', 4,True]
print(list_data)

['2021-0506', '부천대', '전자과', 4, True]

In [7]:
u=pd.Series(list_data)
print(type(u))
u

<class 'pandas.core.series.Series'>

0    2021-0506
1          부천대
2          전자과
3            4
4         True
dtype: object

In [9]:
u.index

RangeIndex(start=0, stop=5, step=1)

u.values

In [11]:
u=pd.Series(list_data,index=['오늘날짜','학교','학문','전공','취업여부'])
print(u)

오늘날짜    2021-0506
학교            부천대
학문            전자과
전공              4
취업여부         True
dtype: object

In [12]:
u.index

Index(['오늘날짜', '학교', '학문', '전공', '취업여부'], dtype='object')

In [13]:
print(u[['학교']])

학교    부천대
dtype: object

In [15]:
print(u[['학교','학문']])

학교    부천대
학문    전자과
dtype: object

In [18]:
print(u['학교':'취업여부'])

학교       부천대
학문       전자과
전공         4
취업여부    True
dtype: object

In [19]:
dict_data={'a':[1,2,3],'b':[4,5,6],'c':[7,8,9]}
k=pd.DataFrame(dict_data)
print(type(k))
print(k) #a,b,c가 컬럼 / 0,1,2가 인덱스

<class 'pandas.core.frame.DataFrame'>
   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [25]:
k=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['전자과','정보통신과','세무회계'],
                        columns=['a동','b동','c동'] )

k

       a동  b동  c동
전자과     1   2   3
정보통신과   4   5   6
세무회계    7   8   9

In [23]:
k.columns

Index(['a동', 'b동', 'c동'], dtype='object')

In [24]:
k.index

Index(['전자과', '정보통신과', '세무회계'], dtype='object')

In [26]:
k.index=['1','2','3']

In [27]:
k.index

Index(['1', '2', '3'], dtype='object')

In [57]:
k.columns=['skt','kt','lg']
k

   skt  kt  lg
1    1   2   3
2    4   5   6
3    7   8   9

In [60]:
k = k.rename(index={'1':'kl'})
k

    skt  kt  lg
kl    1   2   3
2     4   5   6
3     7   8   9

In [61]:
k = k.rename(columns={'skt':'ii'})
print(k)

    ii  kt  lg
kl   1   2   3
2    4   5   6
3    7   8   9

In [62]:
exam_data={'수학':[80,90,100],'국어':[10,20,30],
          '영어':[80,85,86],'과학':[70,60,80]}
df = pd.DataFrame(exam_data, index=['진희','영우','상윤'])
df

     수학  국어  영어  과학
진희   80  10  80  70
영우   90  20  85  60
상윤  100  30  86  80

In [63]:
df1=df[:]
df1.drop('상윤',inplace=True)
df1

C:\Users\moonj\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    수학  국어  영어  과학
진희  80  10  80  70
영우  90  20  85  60

In [72]:
df2=df[:]
df2.drop(['진희','영우'], inplace=True)
df2

C:\Users\moonj\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

     수학  국어  영어  과학
상윤  100  30  86  80

In [80]:
df2.drop(['영어','수학'],axis=1,inplace=True)
df2

C:\Users\moonj\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    국어
상윤  30

# 행선택

In [81]:
loc 인덱스이름을 사용["가" :'라']-가 나 다 라
iloc 정수형인덱스 [3:7]-3,4,5,6

NameError: name 'loc' is not defined

In [82]:
df

     수학  국어  영어  과학
진희   80  10  80  70
영우   90  20  85  60
상윤  100  30  86  80

In [83]:
df.loc['진희']

수학    80
국어    10
영어    80
과학    70
Name: 진희, dtype: int64

In [91]:
df.loc[['영우','상윤']]

     수학  국어  영어  과학
영우   90  20  85  60
상윤  100  30  86  80

In [92]:
df.iloc[0]

수학    80
국어    10
영어    80
과학    70
Name: 진희, dtype: int64

In [93]:
df.iloc[1]

수학    90
국어    20
영어    85
과학    60
Name: 영우, dtype: int64

In [94]:
df.iloc[[0,2]]

     수학  국어  영어  과학
진희   80  10  80  70
상윤  100  30  86  80

In [95]:
df.iloc[[0,1,2]]

     수학  국어  영어  과학
진희   80  10  80  70
영우   90  20  85  60
상윤  100  30  86  80

In [96]:
df.iloc[0:2]

    수학  국어  영어  과학
진희  80  10  80  70
영우  90  20  85  60

In [97]:
df.iloc[0:2,0:1]

    수학
진희  80
영우  90

In [98]:
df.영어

진희    80
영우    85
상윤    86
Name: 영어, dtype: int64

In [99]:
df.과학

진희    70
영우    60
상윤    80
Name: 과학, dtype: int64

In [100]:
df[['영어','수학']]

    영어   수학
진희  80   80
영우  85   90
상윤  86  100

In [107]:
#df.loc['행,'열']
df.loc['진희','수학']

80

In [108]:
df.iloc[1,1]

20

In [109]:
df

     수학  국어  영어  과학
진희   80  10  80  70
영우   90  20  85  60
상윤  100  30  86  80

In [122]:
df.iloc[1,[1,3]]

국어    20
과학    60
Name: 영우, dtype: int64

In [123]:
df['사회']=90
df #열추가

     수학  국어  영어  과학  사회
진희   80  10  80  70  90
영우   90  20  85  60  90
상윤  100  30  86  80  90

In [125]:
#행추가
df.loc['희창']=[80,70,60,40,10]
df

     수학  국어  영어  과학  사회
진희   80  10  80  70  90
영우   90  20  85  60  90
상윤  100  30  86  80  90
희창   80  70  60  40  10

In [134]:
df.loc['은혁']=df.loc['희창']
df

KeyError: '희창'

In [139]:
df.drop('은혁', axis=0,inplace=True)

In [136]:
df

     수학  국어  영어  과학  사회
진희   80  10  80  70  90
영우   90  20  85  60  90
상윤  100  30  86  80  90
은혁   80  70  60  40  10

In [140]:
df

     수학  국어  영어  과학  사회
진희   80  10  80  70  90
영우   90  20  85  60  90
상윤  100  30  86  80  90

In [141]:
df.loc['상윤','영어']=100

In [142]:
df

     수학  국어   영어  과학  사회
진희   80  10   80  70  90
영우   90  20   85  60  90
상윤  100  30  100  80  90

In [145]:
df.iloc[1,3]=100
df

     수학  국어   영어   과학  사회
진희   80  10   80   70  90
영우   90  20   85  100  90
상윤  100  30  100   80  90

In [146]:
df.iloc[0][2]=90
df

     수학  국어   영어   과학  사회
진희   80  10   90   70  90
영우   90  20   85  100  90
상윤  100  30  100   80  90

In [147]:
df.loc['상윤',['영어','과학']]=0
df

     수학  국어  영어   과학  사회
진희   80  10  90   70  90
영우   90  20  85  100  90
상윤  100  30   0    0  90

In [150]:
df.iloc[1,[1,3]]=0
df

     수학  국어  영어  과학  사회
진희   80  10  90  70  90
영우   90   0  85   0  90
상윤  100  30   0   0  90

In [152]:
df.transpose()

    진희  영우   상윤
수학  80  90  100
국어  10   0   30
영어  90  85    0
과학  70   0    0
사회  90  90   90

In [153]:
df.T

    진희  영우   상윤
수학  80  90  100
국어  10   0   30
영어  90  85    0
과학  70   0    0
사회  90  90   90

In [155]:
df.transpose()
df

     수학  국어  영어  과학  사회
진희   80  10  90  70  90
영우   90   0  85   0  90
상윤  100  30   0   0  90

In [160]:
#행 인덱스를 기준으로 데이터 프레임 정렬

dict_data={'a':[1,2,3],'b':[4,5,6],'c':[7,8,9],'d':[3,5,6]}
df = pd.DataFrame(dict_data,index=['r0','r1','r2'])
df

    a  b  c  d
r0  1  4  7  3
r1  2  5  8  5
r2  3  6  9  6

In [161]:
df.sort_index(ascending=True)#ascending : 오름차순 , True 오름차순으로

    a  b  c  d
r0  1  4  7  3
r1  2  5  8  5
r2  3  6  9  6

In [162]:
df.sort_index(ascending=False)#내림차순

    a  b  c  d
r2  3  6  9  6
r1  2  5  8  5
r0  1  4  7  3

In [164]:
df.sort_values(by='a',ascending=True)

    a  b  c  d
r0  1  4  7  3
r1  2  5  8  5
r2  3  6  9  6

In [165]:
df.sort_values(by='a',ascending=False)

    a  b  c  d
r2  3  6  9  6
r1  2  5  8  5
r0  1  4  7  3

In [167]:
st1 = pd.Series({'국어':80,'영어':100,'수학':70})
st2 =  pd.Series({'국어':50,'영어':50,'수학':50})
print(st1)
print(st2)

국어     80
영어    100
수학     70
dtype: int64
국어    50
영어    50
수학    50
dtype: int64

In [168]:
 st1/st2

국어    1.6
영어    2.0
수학    1.4
dtype: float64

In [170]:
st1+st2

국어    130
영어    150
수학    120
dtype: int64

In [171]:
st1*st2

국어    4000
영어    5000
수학    3500
dtype: int64

In [172]:
score=pd.DataFrame([st1,st2])
score

   국어   영어  수학
0  80  100  70
1  50   50  50

In [173]:
st3=pd.Series({'국어':50,'영어':40})
st3

국어    50
영어    40
dtype: int64

In [177]:
k=pd.DataFrame([st1,st2,st3])
k

     국어     영어    수학
0  80.0  100.0  70.0
1  50.0   50.0  50.0
2  50.0   40.0   NaN

In [180]:
st1.add(st2,fill_value=0)

국어    130
영어    150
수학    120
dtype: int64

In [181]:
st1.add(st3,fill_value=0)

국어    130.0
수학     70.0
영어    140.0
dtype: float64

In [182]:
st1

국어     80
영어    100
수학     70
dtype: int64

In [183]:
st3

국어    50
영어    40
dtype: int64

In [186]:
st1.sub(st3,fill_value=0)

국어    30.0
수학    70.0
영어    60.0
dtype: float64

In [185]:
st1-st3

국어    30.0
수학     NaN
영어    60.0
dtype: float64

In [187]:
st1.mul(st3,fill_value=0)

국어    4000.0
수학       0.0
영어    4000.0
dtype: float64

In [188]:
st1*st3

국어    4000.0
수학       NaN
영어    4000.0
dtype: float64

In [191]:
st1.div(st2,fill_value=0)

국어    1.6
영어    2.0
수학    1.4
dtype: float64

In [192]:
st1/st2

국어    1.6
영어    2.0
수학    1.4
dtype: float64

In [195]:
st2.div(st3,fill_value=1)

국어     1.00
수학    50.00
영어     1.25
dtype: float64

In [194]:
st2/st3

국어    1.00
수학     NaN
영어    1.25
dtype: float64

In [196]:
k

     국어     영어    수학
0  80.0  100.0  70.0
1  50.0   50.0  50.0
2  50.0   40.0   NaN

In [210]:
import seaborn as sns

In [200]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [213]:
df=df.iloc[:,[1,3]]
df

IndexError: positional indexers are out-of-bounds

In [214]:
df2 = df.age-df.age
df2.head()

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: age, dtype: float64